Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: For more information about testing your application in dev mode, see the preceding <<oidc-client-keycloak-dev-mode,Running the application in dev mode>> section.
ja_jp: 開発モードでのアプリケーションのテストの詳細は、前述の<<oidc-client-keycloak-dev-mode,Running the application in dev mode>> セクションを参照してください。

source: For more information about the Hibernate Search extension configuration please refer to the <<configuration-reference, Configuration Reference>>.
ja_jp: Hibernate Searchエクステンションの設定については、 <<configuration-reference, 設定リファレンス>> を参照してください。

source: For more information about the Hibernate Search extension configuration please refer to the xref:configuration-reference[Configuration Reference].
ja_jp: Hibernate Searchエクステンションの設定の詳細については、 xref:configuration-reference[設定リファレンス] を参照してください。

source: For more information about the JDBC URL format, please refer to the <<jdbc-url,JDBC url reference section>>.
ja_jp: JDBC URL 形式の詳細については、<<jdbc-url,JDBC url reference section>> を参照してください。

source: For more information about the Mailer configuration please refer to the <<configuration-reference, Configuration Reference>>.
ja_jp: Mailerの設定については、 link:#configuration-reference[設定リファレンス]を参照してください。

source: For more information about the Mailer configuration please refer to the <<configuration-reference,Configuration Reference>>.
ja_jp: Mailer の設定の詳細は、<<configuration-reference,Configuration Reference>> を参照してください。

source: For more information about the Mailer configuration please refer to the xref:configuration-reference[Configuration Reference].
ja_jp: Mailerの設定については、 xref:configuration-reference[設定リファレンス] を参照してください。

source: For more information about the Test Scenario tool, you can reference the Kogito documentation at the links below.
ja_jp: テスト・シナリオ・ツールの詳細については、ページ下部のリンクからKogitoのドキュメントを参照することができます。

source: For more information about the `--initialize-at-run-time` option, see the link:https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/optimizations-and-performance/ClassInitialization/[GraalVM Class Initialization in Native Image] guide.
ja_jp: `--initialize-at-run-time` オプションの詳細については、 link:https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/optimizations-and-performance/ClassInitialization/[ネイティブ・イメージにおけるGraalVMクラスの初期化] ガイドを参照してください。

source: For more information about the `io.quarkus.security.PermissionsAllowed` annotation, see the xref:security-authorize-web-endpoints-reference.adoc#permission-annotation[Permission annotation] section of the "Authorization of web endpoints" guide.
ja_jp: `io.quarkus.security.PermissionsAllowed` アノテーションの詳細は、「Web エンドポイントの認可」ガイドの xref:security-authorize-web-endpoints-reference.adoc#permission-annotation[権限アノテーション] セクションを参照してください。

source: For more information about the adjustments you need to make to your applications, please refer to the https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.30[Quarkus 3.30 migration guide].
ja_jp: アプリケーションに必要な調整の詳細については、 https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.30[Quarkus 3.30 マイグレーションガイド] を参照してください。

source: For more information about the adjustments you need to make to your applications, please refer to the https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.31[Quarkus 3.31 migration guide].
ja_jp: アプリケーションに行う必要がある調整の詳細については、 link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.31[Quarkus 3.31移行ガイド] を参照してください。

source: For more information about the adjustments you need to make to your applications, please refer to the https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.32[Quarkus 3.32 migration guide].
ja_jp: アプリケーションに必要な調整に関する詳細は、 https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.32[Quarkus 3.32 移行ガイド]を参照してください。

source: For more information about the adjustments you need to make to your applications, please refer to the https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.34[Quarkus 3.34 migration guide].
ja_jp: アプリケーションに必要な調整の詳細については、 https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.34[Quarkus 3.34 移行ガイド] を参照してください。

source: For more information about the deprecation, how to set up and use automatic rollbacks, triggers, lifecycle hooks, and custom strategies, see the Red Hat Knowledgebase article https://access.redhat.com/articles/7041372[DeploymentConfig API is being deprecated in Red Hat OpenShift Container Platform 4.14].
ja_jp: 非推奨、自動ロールバック、トリガー、ライフサイクルフック、カスタムストラテジーの設定方法と使用方法の詳細については、Red Hat Knowledgebase の記事 link:https://access.redhat.com/articles/7041372[DeploymentConfig API is being deprecated in Red Hat OpenShift Container Platform 4.14] を参照してください。

source: For more information about the format of this file, see the link:https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/dynamic-features/Reflection/[GraalVM Reflection in Native Image] guide.
ja_jp: このファイルのフォーマットの詳細については、 link:https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/dynamic-features/Reflection/[ネイティブイメージにおけるGraalVMリフレクション] ガイドを参照してください。

source: For more information about the format of this file, see the link:https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/guides/configure-dynamic-proxies/[GraalVM Configure Dynamic Proxies Manually] guide.
ja_jp: このファイルのフォーマットの詳細については、 link:https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/guides/configure-dynamic-proxies/[GraalVM ダイナミックプロキシ手動設定] ガイドを参照してください。

source: For more information about the minimum header requirements, see xref:doc-reference.adoc#document-structure[Document structure] on the "Quarkus style and content guidelines" page.
ja_jp: ヘッダーの最小要件の詳細は、「Quarkus スタイルコンテンツガイドライン」ページの xref:doc-reference.adoc#document-structure[ドキュメント構造] を参照してください。

source: For more information about the minimum header requirements, see xref:{doc-guides}/doc-reference.adoc#document-structure[Document structure] on the "Quarkus style and content guidelines" page.
ja_jp: ヘッダーの最小要件の詳細については、「Quarkusスタイル・コンテンツガイドライン」ページの link:{doc-guides}/doc-reference.html#document-structure[ドキュメント構造] を参照してください。

source: For more information about the usage of a `QuarkusTestResourceLifecycleManager` please read xref:getting-started-testing.adoc#quarkus-test-resource[Quarkus test resource].
ja_jp: `QuarkusTestResourceLifecycleManager` の使い方については、 link:getting-started-testing.html#quarkus-test-resource[Quarkusのテストリソース]をご覧ください。

source: For more information about these attributes, inspect the content of the `docs/src/main/asciidoc/_includes/prerequisites.adoc` file.
ja_jp: これらの属性の詳細は、 `docs/src/main/asciidoc/_includes/prerequisites.adoc` ファイルの内容を確認してください。

source: For more information about this new feature and how to use it in your applications, please refer to link:/guides/hibernate-orm[the Hibernate ORM extension guide].
ja_jp: この新機能の詳細とアプリケーションでの使用方法については、 link:/guides/hibernate-orm[Hibernate ORM エクステンションガイド] を参照してください。

source: For more information about this topic, see the link:https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/dynamic-features/Resources/[GraalVM Accessing Resources in Native Image] guide.
ja_jp: このトピックの詳細については、 link:https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/dynamic-features/Resources/[ネイティブ・イメージでリソースにアクセスするGraalVM] ガイドを参照してください。

source: For more information about using JFR, see the link:https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/debugging-and-diagnostics/JFR/[GraalVM JDK Flight Recorder (JFR) with Native Image] guide.
ja_jp: JFR の使用に関する詳細は、link:https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/debugging-and-diagnostics/JFR/[GraalVM JDK Flight Recorder (JFR) with Native Image] ガイドを参照してください。

source: For more information about using Proxy Classes in native executables, see https://www.graalvm.org/jdk21/reference-manual/native-image/dynamic-features/DynamicProxy/[Dynamic Proxy in Native Image] and https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/guides/configure-dynamic-proxies/[GraalVM Configure Dynamic Proxies Manually].
ja_jp: ネイティブ実行ファイルでのプロキシークラスの使用の詳細は、https://www.graalvm.org/jdk21/reference-manual/native-image/dynamic-features/DynamicProxy/[Dynamic Proxy in Native Image] および https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/guides/configure-dynamic-proxies/[GraalVM Configure Dynamic Proxies Manually] を参照してください。

source: For more information about using the default token cache or registering a custom cache implementation, see xref:security-oidc-bearer-token-authentication.adoc#bearer-token-token-introspection-userinfo-cache[Token introspection and UserInfo cache].
ja_jp: デフォルトのトークンキャッシュの使用またはカスタムキャッシュ実装の登録の詳細は、xref:security-oidc-bearer-token-authentication.adoc#token-introspection-userinfo-cachexref:security-oidc-bearer-token-authentication.adoc#bearer-token-token-introspection-userinfo-cache[トークンのイントロスペクションと UserInfo のキャッシュ] を参照してください。

source: For more information about writing the integration tests that depend on `Dev Services for Keycloak`, see the xref:security-oidc-code-flow-authentication.adoc#code-flow-integration-testing-keycloak-devservices[Dev Services for Keycloak] section.
ja_jp: `Dev Services for Keycloak` に依存する統合テストの書き方については、 xref:security-oidc-code-flow-authentication.adoc#code-flow-integration-testing-keycloak-devservices[Dev Services for Keycloak] のセクションを参照してください。

source: For more information and details on ACR authentication and the use of service principals, follow this guide below and remember the Azure Container Registry `loginServer` and the image name of your Quarkus application now hosted on the ACR.
ja_jp: ACR認証とサービスプリンシパルの使用の詳細と詳細については、以下のガイドに従ってください。Azure Container Registry `loginServer` と、現在ACRでホストされているQuarkusアプリケーションのイメージ名を覚えておいてください。

source: For more information check the xref:context-propagation.adoc#context-propagation-for-cdi[Context Propagation] guide.
ja_jp: 詳細については、xref:context-propagation.adoc#context-propagation-for-cdi[コンテキスト伝搬] ガイドを参照してください。

source: For more information on Hibernate multitenancy, refer to the https://quarkus.io/guides/hibernate-orm#multitenancy[hibernate documentation].
ja_jp: Hibernate マルチテナンシーの詳細は、 https://quarkus.io/guides/hibernate-orm#multitenancy[hibernate ドキュメント] を参照してください。

source: For more information on Kafka Request Reply feature and advanced configuration options, see the https://smallrye.io/smallrye-reactive-messaging/latest/kafka/request-reply/[SmallRye Reactive Messaging Documentation].
ja_jp: Kafka Request Reply 機能と高度な設定オプションの詳細は、 https://smallrye.io/smallrye-reactive-messaging/latest/kafka/request-reply/[SmallRye Reactive Messaging ドキュメント] を参照してください。

source: For more information on URL syntax and additional supported options, see the link:https://www.ibm.com/support/knowledgecenter/SSEPGG_11.5.0/com.ibm.db2.luw.apdv.java.doc/src/tpc/imjcc_r0052342.html[official documentation].
ja_jp: URL構文と追加のサポートされるオプションの詳細については、 link:https://www.ibm.com/support/knowledgecenter/SSEPGG_11.5.0/com.ibm.db2.luw.apdv.java.doc/src/tpc/imjcc_r0052342.html[公式ドキュメント] を参照してください。

source: For more information on contributing to Quarkus docs, see:
ja_jp: Quarkusのドキュメントへの貢献について詳しくはこちらをご覧ください:

source: For more information on dialect selection and database versions, see xref:hibernate-orm.adoc#hibernate-dialect[the corresponding section of the Hibernate ORM guide].
ja_jp: Dialect の選択とデータベースのバージョンに関する詳細は、xref:hibernate-orm.adoc#hibernate-dialect[Hibernate ORM ガイドの該当セクション] を参照してください。

source: For more information on hashing passwords and available options, see xref:security-jpa.adoc#password-storage-and-hashing[Password storage and hashing].
ja_jp: パスワードのハッシュ化と利用可能なオプションに関する詳細については、 xref:security-jpa.adoc#password-storage-and-hashing[パスワードの保存とハッシュ化] を参照してください。

source: For more information on how to configure Auth0 and Quarkus to have authorization code access tokens issued in the JWT format and propagated to service endpoints, see the following <<token-propagation>> and <<jwt-access-tokens>> sections.
ja_jp: Auth0 と Quarkus を設定して認可コードアクセストークンを JWT フォーマットで発行し、サービスエンドポイントに伝播させる方法の詳細は、<<token-propagation>> セクションと<<jwt-access-tokens>> セクションを参照してください。

source: For more information on receiving Cloud Events, see https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.12/amqp/amqp.html#_receiving_cloud_events[Receiving Cloud Events] in SmallRye Reactive Messaging documentation.
ja_jp: クラウドイベントの受信の詳細は、SmallRye リアクティブメッセージングのドキュメントの https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.12/amqp/amqp.html#_receiving_cloud_events[Receiving Cloud Events] を参照してください。

source: For more information on sending Cloud Events, see https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.12/amqp/amqp.html#_sending_cloud_events[Sending Cloud Events] in SmallRye Reactive Messaging documentation.
ja_jp: クラウドイベントの送信の詳細については、SmallRye リアクティブメッセージングのドキュメントの https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.12/amqp/amqp.html#_sending_cloud_events[Sending Cloud Events] を参照してください。

source: For more information on styling, read this blog entry: https://quarkus.io/blog/stylish-api/
ja_jp: スタイリングの詳細については、このブログのエントリーをお読みください https://quarkus.io/blog/stylish-api/

source: For more information please refer to the https://www.jbang.dev/documentation/guide/latest/editing.html[the JBang documentation].
ja_jp: 詳細は link:https://www.jbang.dev/documentation/guide/latest/editing.html[JBangのドキュメント] を参照してください。

source: For more information see our https://infinispan.org/docs/stable/titles/encoding/encoding.html[Cache Encoding and Marshalling] guide.
ja_jp: 詳しくは、 link:https://infinispan.org/docs/stable/titles/encoding/encoding.html[Cache Encoding and Marshalling] ガイドをご覧ください。

source: For more information you can read the xref:elasticsearch-dev-services.adoc[Dev Services for Elasticsearch guide].
ja_jp: 詳細については、 xref:elasticsearch-dev-services.adoc[Dev Services for Elasticsearch ガイド] をご覧ください。

source: For more information, check link:https://github.com/quarkiverse/quarkiverse/wiki[the Quarkiverse Wiki] and link:https://quarkus.io/blog/quarkiverse/[this blog post].
ja_jp: 詳しくは、link:https://github.com/quarkiverse/quarkiverse/wiki[Quarkiverse Wiki] と link:https://quarkus.io/blog/quarkiverse/[このブログ記事] をチェックしてみてください。

source: For more information, look at the link:https://github.com/quarkiverse/quarkiverse/wiki[Quarkiverse Wiki]
ja_jp: 詳細については、 https://github.com/quarkiverse/quarkiverse/wiki[Quarkiverse Wiki]をご覧ください。

source: For more information, please check SmallRye Config link:https://smallrye.io/smallrye-config/Main/config/secret-keys/[Secret Keys] documentation.
ja_jp: 詳しくは、SmallRye Config link:https://smallrye.io/smallrye-config/Main/config/secret-keys/[Secret Keys] のドキュメントをご確認ください。

source: For more information, please check the link:https://smallrye.io/docs/smallrye-config/index.html[SmallRye Config documentation].
ja_jp: 詳細は、link:https://smallrye.io/docs/smallrye-config/index.html[SmallRye Config のドキュメント] を参照してください。

source: For more information, please check the link:https://smallrye.io/smallrye-config/Main/[SmallRye Config documentation].
ja_jp: 詳しくは、link:https://smallrye.io/smallrye-config/Main/[SmallRye Configのドキュメント] をご確認ください。

source: For more information, please check the link:https://smallrye.io/smallrye-config/Main[SmallRye Config documentation].
ja_jp: 詳しくは、 link:https://smallrye.io/smallrye-config/Main[SmallRye Configのドキュメント] をご確認ください。

source: For more information, please check the link:https://smallrye.io/smallrye-config/latest/[SmallRye Config documentation].
ja_jp: 詳細は、link:https://smallrye.io/smallrye-config/latest/[SmallRye Config のドキュメント] を参照してください。

source: For more information, please check the link:https://smallrye.io/smallrye-config/latest[SmallRye Config documentation].
ja_jp: 詳細は、link:https://smallrye.io/docs/smallrye-config/index.html[SmallRye Config のドキュメント] を参照してください。

source: For more information, see <<loggingConfigurationReference>>.
ja_jp: 詳細は、<<loggingConfigurationReference>> を参照してください。

source: For more information, see <<token-propagation-rest,Token Propagation for Quarkus REST>> and <<token-propagation-resteasy,Token Propagation for RESTEasy Classic>>.
ja_jp: 詳細については、<<token-propagation-rest,Token Propagation for Quarkus REST>> と <<token-propagation-resteasy,Token Propagation for RESTEasy Classic>> を参照してください。

source: For more information, see link:https://quarkus.io/blog/path-resolution-in-quarkus/[Path Resolution in Quarkus].
ja_jp: 詳細は、link:https://quarkus.io/blog/path-resolution-in-quarkus/[Path Resolution in Quarkus] を参照してください。

source: For more information, see link:https://quarkus.io/blog/virtual-thread-1/[When Quarkus meets Virtual Threads]
ja_jp: 詳細は、link:https://quarkus.io/blog/virtual-thread-1/[When Quarkus meets Virtual Threads] を参照してください。

source: For more information, see link:https://quarkus.io/guides/deploying-to-kubernetes#client-connection-configuration[deploying to kubernetes].
ja_jp: 詳しくは、 link:https://quarkus.io/guides/deploying-to-kubernetes#client-connection-configuration[kubernetesへのデプロイ] をご覧ください。

source: For more information, see the xref:security-jwt.adoc[Using JWT RBAC] guide.
ja_jp: 詳細は、xref:security-jwt.adoc[JWT RBAC の使用] ガイドを参照してください。

source: For more information, see the 'Configuring the ValidatorFactory' section of the xref:validation.adoc[VALIDATION WITH HIBERNATE VALIDATOR guide].
ja_jp: 詳細は、xref:validation.adoc[VALIDATION WITH HIBERNATE VALIDATOR ガイド] の 'ValidatorFactory の設定' セクションを参照してください。

source: For more information, see the <<configuration-reference,Configuration reference>> section below.
ja_jp: 詳細については、以下の xref:configuration-reference[設定リファレンス] のセクションを参照してください。

source: For more information, see the <<configuration-reference,Configuration reference>> section below. To facilitate the storage of transaction logs in a database by using JDBC, see the xref:transaction.adoc#jdbcstore[Configuring transaction logs to be stored in a datasource] section of the xref:transaction.adoc[Using transactions in Quarkus] guide.
ja_jp: 詳細については、以下の <<configuration-reference,設定リファレンス>> セクションを参照してください。 JDBC を使用してデータベースにトランザクションログを保存しやすくする方法については、 xref:transaction.adoc[Quarkus でのトランザクションの使用] ガイドの xref:transaction.adoc#jdbcstore[データソースに保存されるようにトランザクションログを設定する] セクションを参照してください。

source: For more information, see the Keycloak documentation about how to https://www.keycloak.org/docs/latest/server_admin/index.html#_create-realm[create a new realm].
ja_jp: 詳細は、https://www.keycloak.org/docs/latest/server_admin/index.html#_create-realm[新規レルムの作成] 方法に関する Keycloak ドキュメントを参照してください。

source: For more information, see the Keycloak documentation about link:https://www.keycloak.org/docs/latest/server_admin/index.html#configuring-realms[creating and configuring a new realm].
ja_jp: 詳細は、Keycloak ドキュメントの link:https://www.keycloak.org/docs/latest/server_admin/index.html#configuring-realms[新しいレルムの作成と設定] を参照してください。

source: For more information, see the Quarkus xref:security-identity-providers.adoc[Identity providers] guide.
ja_jp: 詳細については、Quarkus xref:security-identity-providers.adoc[Identityプロバイダー] ガイドを参照してください。

source: For more information, see the Quarkus xref:security-oauth2.adoc[Using OAuth2] guide.
ja_jp: 詳細は、Quarkus xref:security-oauth2.adoc[OAuth2 の使用] ガイドを参照してください。

source: For more information, see the Quarkus xref:security-oidc-configuration-properties-reference.adoc[OpenID Connect (OIDC) configuration properties] guide.
ja_jp: 詳細は、Quarkus の xref:security-oidc-configuration-properties-reference.adoc[OpenID Connect (OIDC) 設定プロパティー] ガイドを参照してください。

source: For more information, see the Quarkus xref:security-openid-connect-multitenancy.adoc#static-tenant-resolution[Using OpenID Connect (OIDC) Multi-Tenancy] guide.
ja_jp: 詳細は、Quarkus の xref:security-openid-connect-multitenancy.adoc#static-tenant-resolution[OpenID Connect (OIDC) マルチテナンシーの使用] ガイドを参照してください。

source: For more information, see the following <<table>> table.
ja_jp: 詳細は、以下の <<table>> の表をご覧ください。

source: For more information, see the following xref:table[Token authentication mechanism comparison] table.
ja_jp: 詳細については、以下の xref:table[トークン認証メカニズム比較] 表を参照してください。

source: For more information, see the https://quarkus.io/version/main/guides/cache-redis-reference[dedicated guide].
ja_jp: 詳しくは、 link:https://quarkus.io/version/main/guides/cache-redis-reference[専用ガイド] をご覧ください。

source: For more information, see the https://vale.sh/manual/[Vale CLI Manual].
ja_jp: 詳しくは、 https://vale.sh/manual/[Vale CLI Manual] をご覧ください。

source: For more information, see the https://www.keycloak.org/docs/latest/server_admin/#protocol[Keycloak server administration guide].
ja_jp: 詳細は、https://www.keycloak.org/docs/latest/server_admin/#protocol[Keycloak サーバー管理ガイド] を参照してください。

source: For more information, see the link:https://db.apache.org/derby/docs/10.8/devguide/cdevdvlp17453.html#cdevdvlp17453[official documentation].
ja_jp: 詳しくは link:https://db.apache.org/derby/docs/10.8/devguide/cdevdvlp17453.html#cdevdvlp17453[公式ドキュメント] をご覧ください。

source: For more information, see the link:https://dev.mysql.com/doc/connector-j/en/[official documentation].
ja_jp: 詳しくは link:https://dev.mysql.com/doc/connector-j/en/[公式ドキュメント] をご覧ください。

source: For more information, see the link:https://docs.microsoft.com/en-us/sql/connect/jdbc/connecting-to-sql-server-with-the-jdbc-driver?view=sql-server-2017[official documentation].
ja_jp: 詳しくは link:https://docs.microsoft.com/en-us/sql/connect/jdbc/connecting-to-sql-server-with-the-jdbc-driver?view=sql-server-2017[公式ドキュメント] をご覧ください。

source: For more information, see the link:https://docs.openshift.com/container-platform/[Red Hat Openshift Container Platform] documentation.
ja_jp: 詳細は、 link:https://docs.openshift.com/container-platform/[Red Hat Openshift Container Platform] のドキュメントを参照してください。

source: For more information, see the link:https://docs.oracle.com/en/database/oracle/oracle-database/21/jjdbc/data-sources-and-URLs.html#GUID-AEA8E228-1B21-4111-AF4C-B1F33744CA08[official documentation].
ja_jp: 詳しくは link:https://docs.oracle.com/en/database/oracle/oracle-database/21/jjdbc/data-sources-and-URLs.html#GUID-AEA8E228-1B21-4111-AF4C-B1F33744CA08[公式ドキュメント] をご覧ください。

source: For more information, see the link:https://h2database.com/html/features.html#database_url[official documentation].
ja_jp: 詳しくは link:https://h2database.com/html/features.html#database_url[公式ドキュメント] をご覧ください。

source: For more information, see the link:https://mariadb.com/kb/en/library/about-mariadb-connector-j/[official documentation].
ja_jp: 詳しくは link:https://mariadb.com/kb/en/library/about-mariadb-connector-j/[公式ドキュメント] をご覧ください。

source: For more information, see the link:https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/optimizations-and-performance/ClassInitialization/[GraalVM Class Initialization in Native Image] guide.
ja_jp: 詳細については、 link:https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/optimizations-and-performance/ClassInitialization/[ネイティブ・イメージにおけるGraalVMクラスの初期化] ガイドを参照してください。

source: For more information, see the xref:cache.adoc#generating-a-cache-key-with-cachekeygenerator[Generating a cache key with CacheKeyGenerator] section of the Quarkus "Application Data Caching" guide.
ja_jp: 詳細は、Quarkus の「アプリケーションデータキャッシュ」ガイドの xref:cache.adoc#generating-a-cache-key-with-cachekeygenerator[CacheKeyGenerator を使用したキャッシュキーの生成] セクションを参照してください。

source: For more information, see the xref:getting-started-testing.adoc#test-from-ide[Running `@QuarkusTest` from an IDE] section of the Testing your Application guide.
ja_jp: 詳細については、「アプリケーションのテスト」ガイドの xref:getting-started-testing.adoc#test-from-ide[IDE からの @QuarkusTest の実行] セクションを参照してください。
